Revit 2026 API

# IFCProductWrapperAddBuilding Method

---

Adds an IfcBuilding handle to associate with the IfcProduct in this wrapper.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddBuilding(
	IFCAnyHandle buildingHandle
)
```
```vb
Public Sub AddBuilding (
	buildingHandle As IFCAnyHandle
)
```
```cpp
public:
void AddBuilding(
	IFCAnyHandle^ buildingHandle
)
```
```fsharp
member AddBuilding :
        buildingHandle : IFCAnyHandle -> unit
```

#### Parameters

buildingHandle IFCAnyHandle
     The IfcBuilding handle.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCProductWrapper Class

Autodesk.Revit.DB.IFC Namespace